letschat.yml
---
execution:
- concurrency: 3
  iterations: 3
  scenario: Thread Group
scenarios:
  Thread Group:
    default-address: http://aws-big:5000
    data-sources:
    - accounts.csv
    requests:
    - body:
        display-name: ${account}
        email: ${email}
        first-name: ${fname}
        last-name: ${lname}
        password: ${password}
        password-confirm: ${password}
        username: ${account}
      label: register
      method: POST
      url: /account/register

    - label: login
      body:
        password: ${password}
        username: ${account}
      method: POST
      url: /account/login
    - label: emotes
      method: GET
      url: /extras/emotes
    - label: replacements
      method: GET
      url: /extras/replacements
    - label: chat
      method: GET
      url: /socket.io/?EIO=3&transport=polling&t=1477932100202-0
      extract-regexp:
        sid:
          default: NO_MATCH
          match-no: 1
          regexp: '"sid":"(.+)","'
          template: $1$
    - label: chat session
      method: GET
      url: /socket.io/?EIO=3&transport=polling&t=1477932100505-1&sid=${sid}
    - label: chat session
      body: 21:420["account:whoami"]
      method: POST
      url: /socket.io/?EIO=3&transport=polling&t=1477932100655-2&sid=${sid}
    - label: chat session
      method: GET
      url: /socket.io/?EIO=3&transport=polling&t=1477932100711-3&sid=${sid}
    - label: logout
      method: GET
      url: /logout
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false
reporting:
- final_stats

modules:
  blazemeter:
    browser-open: none
    token: cba249c64d8bc461951d
  console:
    disable: true